<policy>
    <!-- General - Name, Enabled/Disabled, Triggers, Frequency, Categories -->
    <general>
        <name>%policy_name%</name>
        <enabled>true</enabled>
        <frequency>Ongoing</frequency>
        <trigger>EVENT</trigger>
        <trigger_checkin>false</trigger_checkin>
        <trigger_enrollment_complete>false</trigger_enrollment_complete>
        <trigger_login>false</trigger_login>
        <trigger_logout>false</trigger_logout>
        <trigger_network_state_changed>false</trigger_network_state_changed>
        <trigger_startup>false</trigger_startup>
        <trigger_other>%ONBOARDING_TRIGGER%</trigger_other>
        <category>
            <name>%POLICY_CATEGORY%</name>
        </category>
    </general>
    <!-- Scope -->
    <scope>
        <all_computers>true</all_computers>
        <exclusions/>
    </scope>
    <!-- Packages -->
    <package_configuration>
        <packages>
            <size>1</size>
            <package>
                <name>%pkg_name%</name>
                <action>Install</action>
            </package>
        </packages>
    </package_configuration>
    <!-- Scripts -->
    <scripts>
        <size>0</size>
    </scripts>
    <!-- Self Service details -->
    <self_service>
    </self_service>
    <!-- Maintenance e.g. recon -->
    <maintenance>
    </maintenance>
    <!-- Files and processes e.g. run command -->
    <files_processes/>
    <!-- User interaction e.g. start and finish messages -->
    <user_interaction>
        <message_start/>
        <message_finish/>
    </user_interaction>
</policy>
