<policy>
    <!-- General - Name, Enabled/Disabled, Triggers, Frequency, Categories -->
    <general>
        <name>%policy_name%</name>
        <enabled>true</enabled>
        <frequency>Ongoing</frequency>
        <trigger>EVENT</trigger>
        <trigger_checkin>true</trigger_checkin>
        <trigger_enrollment_complete>false</trigger_enrollment_complete>
        <trigger_login>false</trigger_login>
        <trigger_logout>false</trigger_logout>
        <trigger_network_state_changed>false</trigger_network_state_changed>
        <trigger_startup>false</trigger_startup>
        <category>
            <name>%POLICY_CATEGORY%</name>
        </category>
    </general>
    <!-- Scope -->
    <scope>
        <all_computers>false</all_computers>
        <computer_groups>
            <computer_group>
                <name>%group_name%</name>
            </computer_group>
        </computer_groups>
        <exclusions/>
    </scope>
    <!-- Packages -->
    <package_configuration>
        <packages>
            <size>1</size>
            <package>
                <name>%pkg_name%</name>
                <action>Install</action>
            </package>
        </packages>
    </package_configuration>
    <!-- Scripts -->
    <scripts>
        <size>1</size>
        <script>
            <name>code42-americas-deployment.sh</name>
            <priority>Before</priority>
            <parameter4/>
            <parameter5/>
            <parameter6/>
            <parameter7/>
            <parameter8/>
            <parameter9/>
            <parameter10/>
            <parameter11/>
        </script>
    </scripts>
    <!-- Self Service details -->
    <self_service>
    </self_service>
    <!-- Maintenance e.g. recon -->
    <maintenance>
    </maintenance>
    <!-- Files and processes e.g. run command -->
    <files_processes/>
    <!-- User interaction e.g. start and finish messages -->
    <user_interaction>
        <message_start/>
        <message_finish/>
    </user_interaction>
</policy>
