Description: Downloads the latest version of BetterTouchTool and makes a pkg. Then, uploads the package to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.jameskane.autopkg-recipes.jamf.bettertouchtool
MinimumVersion: "2.3"
ParentRecipe: com.github.homebysix.pkg.BetterTouchTool

Input:
  NAME: BetterTouchTool
  APP_BUNDLE_ID: "com.hegenberg.BetterTouchTool"
  CATEGORY: Applications
  TRIGGER_NAME: "autoupdate-%NAME%"
  DEFER_TRIGGER: "defer-%NAME%"
  SELF_SERVICE_DESCRIPTION: BetterTouchTool is a great, feature packed FREE app that allows you to configure many gestures for your Magic Mouse, Macbook Trackpad and Magic Trackpad. It also allows you to configure actions for keyboard shortcuts, normal mice and the Apple Remote. In addition to this it has an iOS companion App (BTT Remote) which can also be configured to control your Mac the way you want.
  SELF_SERVICE_ICON: "%NAME%.png"
  UPDATE_PREDICATE: "pkg_uploaded != True"
  STOP_PREDICATE: "NOT virus_total_analyzer_summary_result.data.ratio BEGINSWITH '0'"

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%CATEGORY%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
    Arguments:
      pkg_category: "%CATEGORY%"

  - Processor: StopProcessingIf
    Arguments:
      predicate: "%UPDATE_PREDICATE%"

  - Processor: io.github.hjuutilainen.VirusTotalAnalyzer/VirusTotalAnalyzer

  - Processor: StopProcessingIf
    Arguments:
      predicate: "%STOP_PREDICATE%"

  - Processor: com.github.grahampugh.recipes.commonprocessors/VersionRegexGenerator

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_template: "SmartGroupTemplate-autopatch.xml"
      computergroup_name: "Auto Update: %NAME%"
      replace_group: "True"
      
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_template: "SmartGroupTemplate-notinstalled.xml"
      computergroup_name: "App Not Installed: %NAME%"
      
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_template: "SmartGroupTemplate-installed.xml"
      computergroup_name: "App Installed: %NAME%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfScriptUploader
    Arguments:
      script_category: "AutoPkg"
      script_name: "betterTouchTool-license.sh"
      script_path: "betterTouchTool-license.sh"
      script_priority: "AFTER"
      replace_script: "True"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfScriptUploader
    Arguments:
      script_category: "AutoPkg"
      script_name: "application-quit.sh"
      script_path: "application-quit.sh"
      script_priority: "BEFORE"
      replace_script: "True"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfScriptUploader
    Arguments:
      script_category: "AutoPkg"
      script_name: "auto-update-appQuitter.py"
      script_path: "auto-update-appQuitter.py"
      script_priority: "BEFORE"
      replace_script: "True"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfScriptUploader
    Arguments:
      script_category: "AutoPkg"
      script_name: "auto-update-appQuitter.py"
      script_path: "auto-update-appQuitter.py"
      script_priority: "BEFORE"
      replace_script: "True"               

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfScriptUploader
    Arguments:
      script_category: "AutoPkg"
      script_name: "auto-update-silentUpdate.py"
      script_path: "auto-update-silentUpdate.py"
      script_priority: "BEFORE"
      replace_script: "True" 
      
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      policy_template: "PolicyTemplate-autopatch.xml"
      policy_name: "%NAME% - Auto Update"
      frequency: "Ongoing"
      checkin_bool: "false"
      trigger_name: "%TRIGGER_NAME%"
      POLICY_CATEGORY: "Auto-Update"
      group_name: "Auto Update: %NAME%"
      self_service_bool: "false"
      self_service_action: "Install"
      replace_policy: "True"
      
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      policy_template: "PolicyTemplate-selfservice-install-licensed.xml"
      policy_name: "%NAME% - Self Service Install"
      LICENSE_SCRIPT_NAME: betterTouchTool-license.sh
      frequency: "Ongoing"
      checkin_bool: "false"
      POLICY_CATEGORY: "%CATEGORY%"
      group_name: "App Not Installed: %NAME%"
      self_service_bool: "true"
      self_service_action: "Install"
      icon: "%SELF_SERVICE_ICON%"
      replace_policy: "True"
      
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      policy_template: "PolicyTemplate-selfservice-update.xml"
      policy_name: "%NAME% - Self Service Update"
      script_trigger_name: "%TRIGGER_NAME%"
      frequency: "Ongoing"
      checkin_bool: "false"
      POLICY_CATEGORY: "%CATEGORY%"
      group_name: "Auto Update: %NAME%"
      self_service_bool: "true"
      self_service_action: "Update to"
      icon: "%SELF_SERVICE_ICON%"
      replace_policy: "True"
      
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      policy_template: "PolicyTemplate-selfservice-reinstall-licensed.xml"
      policy_name: "%NAME% - Self Service Re-install"
      LICENSE_SCRIPT_NAME: betterTouchTool-license.sh
      frequency: "Ongoing"
      checkin_bool: "false"
      POLICY_CATEGORY: "%CATEGORY%"
      group_name: "App Installed: %NAME%"
      exclude_group_name: "Auto Update: %NAME%"
      self_service_bool: "true"
      self_service_action: "Re-Install"
      icon: "%SELF_SERVICE_ICON%"
      replace_policy: "True"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      policy_template: "PolicyTemplate-force-update.xml"
      policy_name: "%NAME% - Forced Update"
      script_trigger_name: "%TRIGGER_NAME%"
      POLICY_CATEGORY: "Auto-Update: Forced Update"
      group_name: "Auto Update: %NAME%"
      replace_policy: "True"
      
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      policy_template: "PolicyTemplate-silent.xml"
      policy_name: "%NAME% - Silent Update"
      group_name: "Auto Update: %NAME%"
      script_trigger_name: "%TRIGGER_NAME%"
      replace_policy: "True"